spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_declined_card/sets_error_message_for_declined_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=1&card[exp_year]=2015&card[cvc]=314
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.9.9
      Authorization:
      - Bearer sk_test_M4vSUGDJR5Uw4TyvPstbKppJ
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.9.9","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        My-Macs-MacBook-Pro.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16
        19:40:37 PST 2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 10 Mar 2014 00:11:54 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '570'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_103dY72tP72EN7gHVOgGjLtQ",
          "livemode": false,
          "created": 1394410314,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_103dY72tP72EN7gHZKKzZKbt",
            "object": "card",
            "last4": "0002",
            "type": "Visa",
            "exp_month": 1,
            "exp_year": 2015,
            "fingerprint": "NvwPcxVXPMUQXJY0",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Mon, 10 Mar 2014 00:11:54 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&card=tok_103dY72tP72EN7gHVOgGjLtQ&description=a%20valid%20charge
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.9.9
      Authorization:
      - Bearer sk_test_M4vSUGDJR5Uw4TyvPstbKppJ
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.9.9","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        My-Macs-MacBook-Pro.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16
        19:40:37 PST 2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '88'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Mon, 10 Mar 2014 00:11:55 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_103dY72tP72EN7gHUMs3Hqhu"
          }
        }
    http_version: 
  recorded_at: Mon, 10 Mar 2014 00:11:55 GMT
recorded_with: VCR 2.8.0
